// let x = 5;
// alert(x++);


//console.log([] + false - null + true); // NaN

// let y = 1;
// let x = y = 2;
// alert(x); //x = 2;

// console.log([] + 1 + 2); //12 - строка

// alert("1" [0]); 0 это индекс этой строки, 
// там одно число и это число имеет индекс 0

// console.log(2 && 1 && null && 0 && undefined);
// И всегда запинается на лжи, а || или запинается на правде

// console.log(!!(1 && 2) === (1 && 2));
//будет false

// alert(null || 2 && 3 || 4);
//Вернет 3, посколько 3 - это правда, и преверит сначала выражение 2 && 3 
//поскольку у логического И приоритет больше чем у логического ИЛИ



// const a = [1, 2, 3];
// const b = [1, 2, 3];

// console.log(a == b); // false 

// alert( +"Infinity" );  выведет Infinity


// console.log("Ёжик" > "яблоко");


// console.log(0 || "" || 2 || undefined || true || falsе);
// логическое ИЛИ запинается на правде, поэтому выведет 2